/**
 * Виконано:
 * Студент: Сидорець Максим Віталійович
 * Група: 121
 * Лабораторна робота 1.5
 */
#include <iostream>
int main() {
    // Завдання 1
    float x1 = 5.8, y1 = 39.1, z1 = 70, w1 = 42; // Оголошення та ініціалізація змінних для першого виразу
    bool ResultA = (!(x1 = y1) ^ !(z1 < w1)); // Обчислення першого  виразу
    float x2 = 85, y2 = 85, z2 = 6.4, w2 = 9.3; // Оголошення та ініціалізація змінних для другого виразу
    bool ResultB = (!(x2 = y2) ^ !(z2 < w2)); // Обчислення другого  виразу
    std::cout << "Result 1: " << ResultA << '\n' << "Result 2: " << ResultB << '\n'; // результат

    // Завдання 2
    const long constValue = 49; // Ініціалізація константи
    long varB = -65, varE = 2; // Оголошення змінних
    long varC; // Оголошення змінної varC
    long* ptrC = &varC; // Ініціалізація вказівника на varC
    *ptrC = 23; // Присвоєння значення через вказівник
    bool ResultC = ((constValue ^ (-varB)) - *ptrC) >= (13 + (varE << sizeof(long))); // Обчислення  виразу
    std::cout << "Result 3: " << ResultC << '\n'; //  результат

}